{
  "filename": "thread-model.md",
  "__html": "<h1>Thread Model</h1>\n<h2>Thread Model</h2>\n<ul>\n<li>If events handing can be executed quickly without sending new request like marking in memory. Events should be handled by I/O thread since it reduces thread dispatching.</li>\n<li>If event handling will be executed slowly or needs to send new I/O request like querying from database, events should be handled in thread pool. Otherwise, I/O thread will be blocked and then will be not able to receive requests.</li>\n<li>If events are handled by I/O thread, and send new I/O requests during the handling like sending a l login request during connect event, it will alert with “Potentially leading to deadlock”, but deadlock will not happen actually.</li>\n</ul>\n<p><img src=\"../sources/images/dubbo-protocol.jpg\" alt=\"dubbo-protocol\"></p>\n<p>Thus, we need different dispatch strategies and different thread pool configurations to face difference scenarios.</p>\n<pre><code class=\"language-xml\"><span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">dubbo:protocol</span> <span class=\"hljs-attr\">name</span>=<span class=\"hljs-string\">\"dubbo\"</span> <span class=\"hljs-attr\">dispatcher</span>=<span class=\"hljs-string\">\"all\"</span> <span class=\"hljs-attr\">threadpool</span>=<span class=\"hljs-string\">\"fixed\"</span> <span class=\"hljs-attr\">threads</span>=<span class=\"hljs-string\">\"100\"</span> /&gt;</span>\n</code></pre>\n<h2>Dispatcher</h2>\n<ul>\n<li>all: All messages will be dispatched to thread pool, including request, response, connect event, disconnect event and heartbeat.</li>\n<li>direct: All messages will not be dispatched to thread pool and will be executed directly by I/O thread.</li>\n<li>message: Only request, response messages will be dispatched to I/O thread. Other messages like disconnect, connect, heartbeat messages will be executed by I/O thread.</li>\n<li>execution: Only request message will be dispatched to thread pool. Other messages like response, connect, disconnect, heartbeat will be directly executed by I/O thread.</li>\n<li>connection: I/O thread will put disconnect and connect events in the queue and execute them sequentially, other messages will be dispatched to the thread pool.</li>\n</ul>\n<h2>Thread pool</h2>\n<ul>\n<li>fixed: A fixed size of thread pool. It creates threads when starts, never shut down.（default).</li>\n<li>cached: A cached thread pool. Automatically delete the thread when it’s in idle for one minute. Recreate when needed.</li>\n<li>limit: elastic thread pool. But it can only increase the size of the thread pool. The reason is to avoid performance issue caused by traffic spike when decrease the size of the thread pool.</li>\n</ul>\n"
}