{
  "filename": "architecture.md",
  "__html": "<h1>Architecture</h1>\n<p><img src=\"../sources/images/dubbo-architecture.jpg\" alt=\"dubbo-architucture\"></p>\n<h5>Specification of Node's Role</h5>\n<table>\n<thead>\n<tr>\n<th>Node</th>\n<th>Role Spec</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>Provider</code></td>\n<td>The provider exposes remote services</td>\n</tr>\n<tr>\n<td><code>Consumer</code></td>\n<td>The consumer calls the remote services</td>\n</tr>\n<tr>\n<td><code>Registry</code></td>\n<td>The registry is responsible for service discovery and configuration</td>\n</tr>\n<tr>\n<td><code>Monitor</code></td>\n<td>The monitor counts the number of service invocations and time-consuming</td>\n</tr>\n<tr>\n<td><code>Container</code></td>\n<td>The container manages the services's lifetime</td>\n</tr>\n</tbody>\n</table>\n<h5>Service relationship</h5>\n<ol start=\"0\">\n<li><code>Container</code> is responsible for launching, loading, and running the service <code>Provider</code>.</li>\n<li><code>Provider</code> registers its services to <code>Register</code> at the time it starts.</li>\n<li><code>Consumer</code> subscribes the services it needs from the <code>Register</code> when it starts.</li>\n<li><code>Register</code> returns the <code>Provider</code>s list to <code>Consumer</code>, when it changes, the <code>Register</code> will push the changed data to <code>Consumer</code> through long connection.</li>\n<li><code>Consumer</code> selects one of the <code>Provider</code>s based on soft load balancing algorithm and executes the invocation, if fails, it will choose another <code>Provider</code>.</li>\n<li>Both <code>Consumer</code> and <code>Provider</code> will count the number service invocations and time-consuming in memory, and send the statistics to <code>Monitor</code> every minute.</li>\n</ol>\n<p>Dubbo has the following features: Connectivity, Robustness, Scalability and Upgradeability.</p>\n<h2>Connectivity</h2>\n<ul>\n<li><code>Register</code> is responsible for the registration and search of service addresses, like directory services, <code>Provider</code> and <code>Consumer</code> only interact with the registry during startup, and the registry does not forward requests, so it is less stressed</li>\n<li>'Monitor' is responsible for counting the number of service invocations and time-consuming, the statistics will assembles in <code>Provider</code>'s and <code>Consumer</code>'s memory first and  then sent to <code>Monitor</code></li>\n<li>'Provider' registers services to 'Register' and report time-consuming statistic(not include network overhead) to 'Monitor'</li>\n<li>'Consumer' gets a list of service provider addresses from <code>Registry</code>, call the provider directly according to the LB algorithm, report the time-consuming statistic to <code>Monitor</code>, which includes network overhead</li>\n<li>The connections between <code>Register</code>, <code>Provider</code> and <code>Consumer</code> are long connections, <code>Moniter</code> is an exception</li>\n<li><code>Register</code> is aware of the existence of <code>Provider</code> through the long connection, when <code>Provider</code> gets down, <code>Provider</code> will push the event to <code>Consumer</code></li>\n<li>It doesn't affect the already running instances of <code>Provider</code> and <code>Consumer</code> even all of the <code>Register</code> and <code>Monitor</code> get down, since <code>Consumer</code> got a cache of <code>Provider</code>s list</li>\n<li><code>Register</code> and <code>Monitor</code> are optional, <code>Consumer</code> can connect <code>Provider</code> directly</li>\n</ul>\n<h2>Robustness</h2>\n<ul>\n<li><code>Monitor</code>'s downtime doesn't affect the usage, only lose some sampling data</li>\n<li>When the DB server goes down, <code>Register</code> can return service <code>Provider</code>s list to <code>Consumer</code> by checking its cache, but new <code>Provider</code> cannot regiter any services</li>\n<li><code>Register</code> is a peer cluster, it will automatically switch to another when any instance goes down</li>\n<li>Even all <code>Register</code>'s instances go down, <code>Provider</code> and <code>Consumer</code> can still conmunicate by checking their local cache</li>\n<li>Service <code>Provider</code>s are stateless, one instance's downtime doesn't affect the usage</li>\n<li>After all the <code>Provider</code>s of one service go down, <code>Consumer</code> can not use the that service, and infinitely reconnect to wait for service <code>Provider</code> to recover</li>\n</ul>\n<h2>Scalability</h2>\n<ul>\n<li><code>Register</code> is a peer cluster that can dynamically increases its instances,  all clients will automatically discover the new instances.</li>\n<li><code>Provider</code> is stateless, it can dynamically increases the deployment instances, and the registry will push the new service provider information to the <code>Consumer</code>.</li>\n</ul>\n<h2>Upgradeablity</h2>\n<p>When the service cluster is further expanded and the IT governance structure is further upgraded, dynamic deployment is needed, and the current distributed service architecture will not bring resistance. Here is a possible future architecture:</p>\n<p><img src=\"../sources/images/dubbo-architecture-future.jpg\" alt=\"dubbo-architucture-futures\"></p>\n<h5>Specification of Node's Role</h5>\n<table>\n<thead>\n<tr>\n<th>Node</th>\n<th>Role Spec</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>Deployer</code></td>\n<td>Local proxy for automatic services deployment</td>\n</tr>\n<tr>\n<td><code>Repository</code></td>\n<td>The repository is used to store application packages</td>\n</tr>\n<tr>\n<td><code>Scheduler</code></td>\n<td>The scheduler automatically increases or decreases service providers based on the access pressure</td>\n</tr>\n<tr>\n<td><code>Admin</code></td>\n<td>Unified management console</td>\n</tr>\n<tr>\n<td><code>Registry</code></td>\n<td>the registry is responsible for service discovery and configuration</td>\n</tr>\n<tr>\n<td><code>Monitor</code></td>\n<td>The monitor counts the service call times and time-consuming</td>\n</tr>\n</tbody>\n</table>\n"
}