{
  "filename": "dubbo-k8s.md",
  "__html": "<h1>General goal</h1>\n<p>Dubbo's provider don't care about service registration.Open its Dubbo service port,the declaration and publishment of the service will be executed by kubernetes.\nDubbo's consumer directly discovers the corresponding service endpoints of kubernetes during service discovery procedure, thereby reusing Dubbo's existing microservice channel capabilities.The benefit is that there is no need to rely on any third-party soft-loaded registry and it can be seamlessly integrated into the multi-tenant security system of kubernetes. Reference demo : <a href=\"https://github.com/dubbo/dubbo-kubernetes\">https://github.com/dubbo/dubbo-kubernetes</a></p>\n<h1>Introduction</h1>\n<p>Kubernates is a hierarchical system with rich secondary development function based on the expansibility.</p>\n<ul>\n<li>First of all, Kubernates's core function is to manage the container cluster. Kubernates manages the  storage and calculation of containerized cluster, based on the container runtime (CRI), network interface (CNI) and storage service interface (CSI/FV).</li>\n<li>Secondly，Kubernates has application-oriented deployment and routing capabilities，including statefulness/statelessness，batch processing and service-oriented applications，especially the application management based on microservices architecture which includes service discovery，service definition and unified configuration on the basis of configmap.</li>\n<li>Finally, on top of the abstract model of the basic resource (mainly the resources of abstract infrastructure, IaaS) and the application layer is the governance layer, which includes elastic expansion, namespaces/tenants and so on. Naturally, it is a matter of course to set up service about unified log center and omnidirectional monitoring on the Kubernetes based upon the foundational capabilities of atomic inner core.</li>\n</ul>\n<p>We will explain the above description with a diagram of Kubernetes Architecture. In 2018, Kubernetes took a qualitative step toward the standard PaaS basement.Someone hold opinions that the reason is the ability for secondary development on the basis of the expansion and someone think the key is declarative programming and strong community operations relying on Google and Redhat. However,I think the essential reason is Layered architecture and the abstract domain modeling in the problem domain as the figure below.</p>\n<p><img src=\"../../img/blog/k8s/1.png\" alt=\"img\"></p>\n<p>From a micro-service architecture perspective, Kubernetes is a micro-service framework (more appropriate than a micro-service platform or toolkit set at this time) in a sense, supporting the basic capabilities of microservices for service discovery/registration. Use the following table to make a brief description.</p>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\">The design of microservice</th>\n<th style=\"text-align:left\">The function of Kubernetes</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\">Point 1：API gateway</td>\n<td style=\"text-align:left\">Ingress</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Point 2：Statelessness, distinguish between stateful and stateless applications</td>\n<td style=\"text-align:left\">Stateless corresponds to Deployment，and stateful corresponds to StatefulSet</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Point 3：Horizontal expansion of the database</td>\n<td style=\"text-align:left\">Headless service points to PaaS service or StatefulSet deployment</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Point 4：Cache</td>\n<td style=\"text-align:left\">Headless service points to PaaS service or StatefulSet deployment</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Point 5：Service splitting and service discovery</td>\n<td style=\"text-align:left\">Service</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Point 6：Service orchestration and flexibility</td>\n<td style=\"text-align:left\">Replicas of deployment</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Point 7：Unified configuration center</td>\n<td style=\"text-align:left\">ConfigMap</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Point 8：Unified log center</td>\n<td style=\"text-align:left\">DaemonSet deploys log agent</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Point 9：Circut break, current limiting and downgrade</td>\n<td style=\"text-align:left\">Service Mesh</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Point 10：Comprehensive monitoring</td>\n<td style=\"text-align:left\">Cadsivor, DaemonSet deploys and monitors Agent</td>\n</tr>\n</tbody>\n</table>\n<p>By the way, the microservices field involves many issues, which can be explained as follows. When building microservices, we will delve into Distributed System, a discipline has a 40-year research background and is rooted in the adaptive system theory. It's a bit complicated, but the concepts it covers are more or less heard for us, and it solves problems that we're familiar with:</p>\n<ul>\n<li>Deployment</li>\n<li>Delivery</li>\n<li>APIs</li>\n<li>Versioning</li>\n<li>Contracts</li>\n<li>Scaling / Autoscaling</li>\n<li>Service Discovery</li>\n<li>Load Balancing</li>\n<li>Routing / Adaptive Routing</li>\n<li>Health Checking</li>\n<li>Configuration</li>\n<li>Circuit Breaking</li>\n<li>Bulk-heads</li>\n<li>TTL / Deadlining</li>\n<li>Latency Tracing</li>\n<li>Service Causal Tracing</li>\n<li>Distributed logging</li>\n<li>Metrics Exposure, Collection</li>\n</ul>\n<p>For Kubernetes, only a few of problems are solved. Problems such as Dynamic Routing, Stability Control (Circuit Breaking, Bulk-heads, etc.) , Distributed Service Tracking, etc. are all the blank. These problems are exactly what Service Mesh needs to solve, and these also plays an important role in CNCF's Tail Map. Of course, as Dubbo is a basically complete microservices infrastructure (Dubbo is based on the Sidecar which is a common solution for solving cross-language claims in Service Mesh, and the details of Dubbo are so complicated that they need to be explained in the new topic ) , that is to say, it is very meaningful to integrate Dubbo into the k8s system. The original definition of Service Mesh is cited below:</p>\n<blockquote>\n<p><span data-type=\"color\" style=\"color:rgb(119, 119, 119)\"><span data-type=\"background\" style=\"background-color:rgb(255, 255, 255)\">A service mesh is a dedicated infrastructure layer for handling service-to-service communication. It's responsible for the reliable delivery of requests through the complex topology of services that comprise a modern, cloud native application.</span></span></p>\n</blockquote>\n<p>We will know the existing solution, Dubbo integrates the Clould Native Equipment - Kubernetes's basic abilities to solve the microservices's core problems, can be regarded as a Service Mesh solution in a narrow sense, but it can only be used in the Java field. You can understand the above words as a joke, haha.</p>\n<h1>T<span data-type=\"color\" style=\"color:rgb(51, 51, 51)\"><span data-type=\"background\" style=\"background-color:rgb(255, 255, 255)\">hought</span></span>/Plan</h1>\n<p>Kubernetes is a natural address registration center for microservices, similar to zookeeper, VIPserver and Configserver used internally by Alibaba. Specifically, the Pod in kubernetes is a running instance of the application. The scheduled deployment/start/stop of the Pod will call the API-Server service to maintain its state to ETCD. The service in kubernetes is coresponded to the concept of the microservices defined as follows.</p>\n<blockquote>\n<p>A Kubernetes Service is an abstraction layer which defines a logical set of Pods and enables external traffic exposure, load balancing and service discovery for those Pods.</p>\n</blockquote>\n<p>In conclusion, the kubernetes service has the following characteristics:</p>\n<ul>\n<li>Each Service has a unique name and corresponding IP. IP is automatically assigned by kubernetes and the name is defined by the developer.</li>\n<li>Service IP has several manifestations: ClusterIP, NodePort, LoadBalance and Ingress. ClusterIP is mainly used for intra-cluster communication; NodePort, Ingress and LoadBalance, which are used to expose services to access portals outside the cluster.</li>\n</ul>\n<p>At first sight, the service of kubernetes has its own IP, while under the original fixed mindset: Dubbo/HSF service is aggregated by the IP of the entire service cluster, that means, kubernetes and Dubbo/HSF look like something different in natural, but when carefully thinking, the difference becomes insignificant. Because the only IP under kubernetes is just a Virtural IP--VIP, behind the vip are multiple endpoints, which is the factual processing node.</p>\n<p>Here we only discuss the situation that the Dubbo service in the cluster is accessed in the same kubernetes cluster, As for the provider outside kubernetes to access the provider in kubernetes, since it involves the problem of network address space, and it usually requires GateWay/loadbalance for mapping conversion, which there not detail discussion for this case. Besides, there are two options available for kubernetes:</p>\n<ol>\n<li>\n<p>DNS: The default kubernetes service is based on the DNS plugin (The latest version of the recommendation is coreDNS), one proposal on Dubbo is about this.  since HSF/Dubbo has always highlighted its soft-load address discovery capability, it ignores Static's strategy insteadily, my understanding is that as a service discovery mechanism, the static resolution mechanism is one of the simplest and most needed to support mechanism, you can also refer to Envoy's point of views. While at the same time, ant's SOFA has always supported this static strategy, it can provides an explanation for an engineering fragment of the SOFA project. There are two advantages to doing this. 1) When the soft load center crash is unavailable and the address list cannot be obtained, there is a mechanism to Failover to this policy to handle certain requests. 2) Under LDC/unitization, the ant's load center cluster is deployed in the equipment room/area. First, the LDC of the soft load center is guaranteed to be stable and controllable. When the unit needs the request center, the address of the VIP can come in handy.</p>\n<p><img src=\"https://img.alicdn.com/tfs/TB1Kj1ktpkoBKNjSZFEXXbrEVXa-985-213.png\" alt=\"img\"></p>\n</li>\n<li>\n<p>API：DNS relies on the DNS plugin, which will generate additional operation, so consider directly obtaining the endpoint through the client of kubernetes. In fact, by accessing the API server interface of kubernetes, you can directly obtain the list of endpoints behind a certain servie, and can also monitor the changes in its address list. Thereby implementing the soft load discovery strategy recommended by Dubbo/HSF. Refer to the code for details:</p>\n</li>\n</ol>\n<p>The above two thoughts need to consider the following two points:</p>\n<ol>\n<li>Kubernetes and Dubbo are consistent with the mapping name of service. Dubbo's service is determined by serviename, group, version to determine its uniqueness, and servicename generally has a longer package name for its service interface. Need to map the servie name of kubernetes and the service name of dubbo. Either add a property like SOFA to define it. This is a big change, but it is most reasonable. Or it is a fixed rule to reference the deployed environment variables, which can be used for quick verification.</li>\n<li>Port problem:The default Pod and Pod network interoperability is solved, need to be validated.</li>\n</ol>\n<h2>Demo Verification</h2>\n<p>The following is a demo deployment through kubernetes service in Alibaba Cloud's Container Registry and   EDAS. Visit Alibaba Cloud -》Container Registry.</p>\n<ol>\n<li>Create repo and bind the github codebase. As shown below.</li>\n</ol>\n<p><img src=\"https://img.alicdn.com/tfs/TB1m.tEtrorBKNjSZFjXXc_SpXa-1892-870.png\" alt=\"img\"></p>\n<ol start=\"2\">\n<li>\n<p>Click Manage enter the repository details page. Click Build in images service panel,  construct the demo into image and publish it to the specified repository. As shown below.</p>\n<p><img src=\"https://img.alicdn.com/tfs/TB1oYqvtcIrBKNjSZK9XXagoVXa-1872-888.png\" alt=\"img\"></p>\n</li>\n<li>\n<p>Switch to Enterprise Distributed Application Services (EDAS) products panel, visit Resource Management -》Clusters. Create kubernetes cluster and bind ECS. As shown below.</p>\n<p><img src=\"https://img.alicdn.com/tfs/TB1b1p2trZnBKNjSZFKXXcGOVXa-1858-833.png\" alt=\"img\"></p>\n</li>\n<li>\n<p>Application Management - 》Create  application, type kubernetes application and specify the image in the container registry . As shown below.</p>\n<p><img src=\"https://img.alicdn.com/tfs/TB1_YywtDCWBKNjSZFtXXaC3FXa-1737-588.png\" alt=\"img\"></p>\n<p><img src=\"https://img.alicdn.com/tfs/TB18uzTtdcnBKNjSZR0XXcFqFXa-1820-861.png\" alt=\"\"></p>\n</li>\n<li>\n<p>After creation , then deploy applications. As shown below.</p>\n</li>\n</ol>\n<p><img src=\"https://img.alicdn.com/tfs/TB1fEpEtrorBKNjSZFjXXc_SpXa-1846-783.png\" alt=\"\"></p>\n<ul>\n<li>\n<p>The supplementary application name cannot have uppercase letters, all lowercase, otherwise there is a problem of deployment failure.</p>\n</li>\n<li>\n<p>When creating an app, after selecting the image, the next button cannot be clicked and you need to click Choose to continue.</p>\n</li>\n<li>\n<p>EDAS has two independent kubernetes services, one based on Alibaba Cloud's container service, and one set by Lark. I experience the latter.</p>\n</li>\n<li>\n<p>The development joint of Docker and IDE integration, you need to consider the relevant plug-ins for integrating IDEA.</p>\n</li>\n<li>\n<p>There is always an error in deployment, maybe there is a problem with the kubernetes service. Need further investigation.</p>\n</li>\n</ul>\n<p>{&quot;kind&quot;:&quot;Pod&quot;,&quot;namespace&quot;:&quot;lzumwsrddf831iwarhehd14zh2-default&quot;,&quot;name&quot;:&quot;dubbo-k8s-demo-610694273-jq238&quot;,&quot;uid&quot;:&quot;12892e67-8bc8-11e8-b96a-00163e02c37b&quot;,&quot;apiVersion&quot;:&quot;v1&quot;,&quot;resourceVersion&quot;:&quot;850282769&quot;},&quot;reason&quot;:&quot;FailedSync&quot;,&quot;message&quot;:&quot;Error syncing pod&quot;,&quot;</p>\n"
}