{
  "filename": "dubbo-loadbalance.md",
  "__html": "<h1>Dubbo's Load Balance</h1>\n<h2>Background</h2>\n<p>Dubbo is a distributed service framework that avoids single point of failure and horizontal expansion of support services. A service typically deploys multiple instances. How to select a call from a cluster of multiple service providers involves a load balancing strategy.</p>\n<h2>Concepts</h2>\n<p>Before discussing load balancing, I will explain these three concepts first.</p>\n<ol>\n<li>Load Balancing</li>\n<li>Fault-tolerant Cluster</li>\n<li>Service Route</li>\n</ol>\n<p>These three concepts are confusing. They all describe how to choose from multiple Providers to make calls. So what is the difference between them? Let me give a simple example and explain these concepts clearly.</p>\n<p>There is a Dubbo user service, 10 deployed in Beijing and 20 deployed in Shanghai. A service consumer in Hangzhou initiated a call and then the following steps executed:</p>\n<ol>\n<li>According to the configured routing rule, if the call is initiated by Hangzhou, it will be routed to the nearest 20 Providers in Shanghai.</li>\n<li>According to the configured random load balancing strategy, one of the 20 Providers is randomly selected to be called, assuming that the 7th Provider is randomly selected.</li>\n<li>As a result, calling the 7th Provider failed.</li>\n<li>Retried other servers according to the configured Fault-tolerant Cluster mode.</li>\n<li>The call to the 13th Provider was successful.</li>\n</ol>\n<p>Steps 1, 2, and 4 above correspond to routing, load balancing, and fault-tolerant cluster. In Dubbo, a subset is selected by routing from multiple Providers according to routing rules, then a Provider selected from the subset according to load balancing to make this call. If the call fails, Dubbo retry or schedule retransmission or fail-fast according to the Fault-tolerant Cluster policy. You can see the routes in Dubbo, load balancing and Fault-tolerant Cluster exectute at different stages of an RPC call. The first stage is routing, then load balancing, and finally cluster fault tolerance. This document only discusses load balancing, routing and cluster fault tolerance are described in other documents.</p>\n<h2>Dubbo's Internal Load Balancing Strategy</h2>\n<p>Dubbo has four Internal Load Balancing Strategies:</p>\n<ol>\n<li>RandomLoadBalance: Random load balancing. Choose a Provider randomly. It is Dubbo's default load balancing strategy.</li>\n<li>Round Robin Load Balancing: Polling load balancing, then chooses one Provider.</li>\n<li>LeastActiveLoadBalance: The minimum number of active calls, the random number of the same active number. The active number refers to the difference before and after the call. Make slow providers receive fewer requests, because the slower Provider before and after the difference of calls will be larger.</li>\n<li>ConsistentHashLoadBalance: Consistent hash load balancing. Requests with the same parameters always fall on the same machine.</li>\n</ol>\n<h3>1. Random Load Balancing</h3>\n<p>As the name implies, the random load balancing strategy is to select one from multiple Providers randomly. However, random load balancing in Dubbo has a weighting concept that sets the random probability according to the weight. For example, there are 10 Providers, it's not to say that the probability of each Provider is the same, but to assign the probability by combining the weights of these 10 providers.</p>\n<p>In Dubbo, you can set weights on the Provider. For example, if the performance of the machine is better, you can set a larger weight. If the performance is poorer, you can set a smaller weight. Weights have an impact on load balancing. The weight of provider can be set in Dubbo Admin.</p>\n<h4>Weight-based Load Balancing Algorithm</h4>\n<p>The stochastic strategy will determine whether the weights of all the invokers are the same at first. If they are all the same, then the processing is relatively simple. Using <code>random.nexInt(length)</code>, you can randomly generate an invoker serial number, and select the corresponding invoker according to the serial number. If the service provider not set weight in Dubbo Admin, then all the invokers have the same weight, the default is 100. If the weights are different, then you need to combine the weights to set the random probability. The algorithm is probably as follows: If there are 4 invokers</p>\n<table>\n<thead>\n<tr>\n<th>Invoker</th>\n<th>Weight</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>A</td>\n<td>10</td>\n</tr>\n<tr>\n<td>B</td>\n<td>20</td>\n</tr>\n<tr>\n<td>C</td>\n<td>20</td>\n</tr>\n<tr>\n<td>D</td>\n<td>30</td>\n</tr>\n</tbody>\n</table>\n<p>The total weight of A, B, C and D is 10 + 20 + 20 + 30 = 80. Spread 80 numbers in the following diagram:</p>\n<pre><code>+-----------------------------------------------------------------------------------+\n|          |                    |                    |                              |\n+-----------------------------------------------------------------------------------+\n1          10                   30                   50                             80\n\n|-----A----|---------B----------|----------C---------|---------------D--------------|\n\n\n---------------------15\n\n-------------------------------------------37\n\n-----------------------------------------------------------54\n</code></pre>\n<p>There are four areas in the above picture, and the lengths are the weights of A, B, C and D, respectively. Use <code>random.nextInt(10 + 20 + 20 + 30)</code> to randomly select one of the 80 numbers. Then determine which area the number is distributed in. For example, if random to 37, 37 is distributed in the C region, then select inboker C. 15 is in the B area, 54 is in the D area.</p>\n<h4>Random load balancing Source code</h4>\n<p>Below is the source code for random load balancing. For ease of reading and understanding, I removed the extraneous parts.</p>\n<pre><code>public class RandomLoadBalance extends AbstractLoadBalance {\n\n    private final Random random = new Random();\n\n    protected &lt;T&gt; Invoker&lt;T&gt; doSelect(List&lt;Invoker&lt;T&gt;&gt; invokers, URL url, Invocation invocation) {\n        int length = invokers.size();      // total invoker\n        int totalWeight = 0;               // Sum of invokers' weights\n\n        // Determine if all the invokers have the same weight\n        // If the weights are the same, it is simple to generate an index directly from Random.\n        boolean sameWeight = true;\n        for (int i = 0; i &lt; length; i++) {\n            int weight = getWeight(invokers.get(i), invocation);\n            totalWeight += weight; // Sum\n            if (sameWeight &amp;&amp; i &gt; 0 &amp;&amp; weight != getWeight(invokers.get(i - 1), invocation)) {\n                sameWeight = false;\n            }\n        }\n\n        if (totalWeight &gt; 0 &amp;&amp; !sameWeight) {\n            // If not all of the invoker weights are the same, load balancer will randomly choose invoker based on its weight. The greater the weight, the greater the probability of being selected\n            int offset = random.nextInt(totalWeight);\n            for (int i = 0; i &lt; length; i++) {\n                offset -= getWeight(invokers.get(i), invocation);\n                if (offset &lt; 0) {\n                    return invokers.get(i);\n                }\n            }\n        }\n        // If all invokers have the same weight\n        return invokers.get(random.nextInt(length));\n    }\n}\n</code></pre>\n<h3>2. Round Robin Load Balancing</h3>\n<p>Round Robin Load Balancing, is to call all Providers in turn. As with random load balancing strategies, Round Robin Load Balancing policies also has a weighting concept. The Round Robin Load Balancing algorithm allows RPC calls to be allocated exactly as we set. Whether it is a small or large number of calls. However, there are also some shortcomings in the Round Robin Load Balancing algorithm. There is a problem that the slow provider accumulates the request. For example, the second machine is slow, but it is not crashed. When the request is transferred to the second machine, it is stuck. Over time, all The request get stuck on the second machine, causing the entire system to slow down.</p>\n<h3>3. Minimum Active Call Load Balancing</h3>\n<p>Official explanation:</p>\n<blockquote>\n<p>The active number refers to the difference between the counts before and after the call. Select the machine with the minimum number of active calls or choose a random one among machines with the same active number, so that the slower machine can receives less requests.</p>\n</blockquote>\n<p>This explanation seems to be ambigious. We know the purpose is to ensure the slower machine receive less requests, but it is not clear how to achieve it. An example is here: each service maintains an active number counter. When A machine starts processing the request, the counter is incremented by 1. At this time, A is still processing. If the processing is completed, the counter is decremented by 1. B machine processes very quickly after receiving the request. Then the active numbers of A and B are 1,0 respectively. When a new request is generated, the B machine is selected for execution (as B has the minimum active number), so that the slower machine A receives fewer requests.</p>\n<p>When processing a new request, Consumer will check the active number of all Providers. If there is only one Invoker with the minimum active number, the Invoker is returned directly.</p>\n<pre><code>if (leastCount == 1) {\n    // if there is only one minimum value then return directly\n    return invokers.get(leastIndexs[0]);\n}\n</code></pre>\n<p>If there are multiple Invokers with the minimum active number, plus the weights are not equal and the total weight is greater than 0, then generate a random weight ranging from 0 to totalWeight. Finally, the Invoker is selected based on the randomly generated weights.</p>\n<pre><code>if (! sameWeight &amp;&amp; totalWeight &gt; 0) {\n    // if the weights are not equal and the toatl weight is greater than 0 then choose randomly according to total weight\n\n    int offsetWeight = random.nextInt(totalWeight);\n\n    // and determine which segment the random value falls on.\n\n    for (int i = 0; i &lt; leastCount; i++) {\n        int leastIndex = leastIndexs[i];\n        offsetWeight -= getWeight(invokers.get(leastIndex), invocation);\n        if (offsetWeight &lt;= 0)\n            return invokers.get(leastIndex);\n    }\n}\n</code></pre>\n<h3>4. Consistent Hash Algorithm</h3>\n<p>Use consistent hash algorithm to ensure that requests with same parameters are always sent to the same Provider. When a Provider crashes, requests originally sent to the Provider is spread evenly to other Providers based on the virtual node without causing drastic changes. The algorithm can be seen at: <a href=\"http://en.wikipedia.org/wiki/Consistent_hashing\">http://en.wikipedia.org/wiki/Consistent_hashing</a></p>\n<p>By default, only the first parameter is hashed. Configure if you would like to modify it:</p>\n<pre><code>&lt;dubbo:parameter key=&quot;hash.arguments&quot; value=&quot;0,1&quot; /&gt;\n</code></pre>\n<p>By default, 160 virtual nodes are used. Configure if you would like to modify it:</p>\n<pre><code>&lt;dubbo:parameter key=&quot;hash.nodes&quot; value=&quot;320&quot; /&gt;\n</code></pre>\n<p>Consistent hash algorithms can be used in conjunction with caching mechanisms. For example, there is a service getUserInfo(String userId). After the hash algorithm is set, the same userId call is sent to the same Provider. This Provider can cache user data in memory, reducing the number of accesses to the database or distributed cache. If this part of the data is allowed to be inconsistent for some time, this approach can be considered. The number of dependencies and accesses to middleware such as databases, caches, etc. and network IO operations is reduced, while the system performance is improved.</p>\n<h2>Load Balancing Configuration</h2>\n<p>If load balancing is not specified, random load balancing is used by default. Load balancing can also be explicitly specified based on our needs. Load balancing can be configured in multiple local classes, such as Provider Side, Consumer Side, Service Level, and Method Level.</p>\n<h3>Server Side Service Level</h3>\n<pre><code>&lt;dubbo:service interface=&quot;...&quot; loadbalance=&quot;roundrobin&quot; /&gt;\n</code></pre>\n<p>All methods of the service use roundrobin load balancing.</p>\n<h3>Client Side Service Level</h3>\n<pre><code>&lt;dubbo:reference interface=&quot;...&quot; loadbalance=&quot;roundrobin&quot; /&gt;\n</code></pre>\n<p>All methods of the service use roundrobin load balancing.</p>\n<h3>Server Side Method Level</h3>\n<pre><code>&lt;dubbo:service interface=&quot;...&quot;&gt;\n    &lt;dubbo:method name=&quot;hello&quot; loadbalance=&quot;roundrobin&quot;/&gt;\n&lt;/dubbo:service&gt;\n</code></pre>\n<p>Only the hello method of the service uses roundrobin load balancing.</p>\n<h3>Client Side Method Level</h3>\n<pre><code>&lt;dubbo:reference interface=&quot;...&quot;&gt;\n    &lt;dubbo:method name=&quot;hello&quot; loadbalance=&quot;roundrobin&quot;/&gt;\n&lt;/dubbo:reference&gt;\n</code></pre>\n<p>Only the hello method of the service uses roundrobin load balancing.</p>\n<p>Similar to other Dubbo configurations, multiple configurations are covered:</p>\n<ol>\n<li>The method level takes precedence, the interface level is next, and the global configuration comes last.</li>\n<li>If the level is the same, the Consumer is given priority and the Provider is next</li>\n</ol>\n<p>Therefore, the priority of the above four configurations is:</p>\n<ol>\n<li>Client side method level configuration.</li>\n<li>Client side interface level configuration.</li>\n<li>Server side method level configuration.</li>\n<li>Server side interface level configuration.</li>\n</ol>\n<h2>Extended Load Balancing</h2>\n<p>Four load balancing implementations of Dubbo meet the requirements in most cases. Sometimes, we may need to implement our own load balancing strategy because of the needs of the business. This chapter only explains how to configure the load balancing algorithm. For more on the Dubbo extension mechanism, go to the Dubbo extension mechanism practice.</p>\n<ol>\n<li>Implementing the LoadBalance interface</li>\n</ol>\n<p>The following is Dubbo's LoadBalance interface:</p>\n<pre><code>@SPI(RandomLoadBalance.NAME)\npublic interface LoadBalance {\n    @Adaptive(&quot;loadbalance&quot;)\n    &lt;T&gt; Invoker&lt;T&gt; select(List&lt;Invoker&lt;T&gt;&gt; invokers, URL url, Invocation invocation) throws RpcException;\n}\n</code></pre>\n<p>This is the interface of the SPI. The parameters of the select method are as follows:</p>\n<ul>\n<li>invokers: A list of all service Providers.</li>\n<li>url: Some configuration information, such as interface name, check or not, serialization.</li>\n<li>invocation: Information called by the RPC, including the method name, method parameter type, and method parameters. Here is a LoadBalance implemented by us. The implementation is very simple - Choose the first Invoker:</li>\n</ul>\n<pre><code>package com.demo.dubbo;\npublic class DemoLoadBalance implements LoadBalance {\n    @Override\n    public &lt;T&gt; Invoker&lt;T&gt; select(List&lt;Invoker&lt;T&gt;&gt; invokers, URL url, Invocation invocation) throws RpcException {\n        System.out.println(&quot;[DemoLoadBalance]Select the first invoker...&quot;);\n        return invokers.get(0);\n    }\n}\n</code></pre>\n<ol start=\"2\">\n<li>Add a resource file</li>\n</ol>\n<p>Add a file:\n<code>src/main/resource/META-INF/dubbo/com.alibaba.dubbo.rpc.cluster.LoadBalance</code>\nThis is a simple text file. The file contents are as follows:</p>\n<pre><code>demo=my=com.demo.dubbo.DemoLoadBalance\n</code></pre>\n<ol start=\"3\">\n<li>Configure to use custom LoadBalance</li>\n</ol>\n<pre><code>&lt;dubbo:reference id=&quot;helloService&quot; interface=&quot;com.demo.dubbo.api.IHelloService&quot; loadbalance=&quot;demo&quot; /&gt;\n</code></pre>\n<p>Configure  <code>&lt;loadbalance=&quot;demo&quot;&gt;</code> in <code>dubbo:reference</code> at the Consumer side.</p>\n<p>After 3 steps above, we wrote a custom LoadBalance and told Dubbo to use it. Start Dubbo and we can see that Dubbo has used a custom DemoLoadBalance.</p>\n",
  "link": "/en-us/blog/dubbo-loadbalance.html",
  "meta": {
    "title": "Dubbo's Load Balance",
    "keywords": "Dubbo, LoadBalance",
    "description": "This article introduces you what is load balance and how load balance strategy is implemented in Dubbo."
  }
}